Connect to the **petsDB** and check whether the connection has been successful

In [1]:
import sqlite3

In [6]:
def chk_conn(conn):
     try:
        conn.cursor()
        return "Connection Successful"
     except Exception as ex:
        return "Connection Failed"

In [9]:
conn = sqlite3.connect('petsdb')
print(chk_conn(conn))

Connection Successful

Find the different age groups in the persons database

In [11]:
import pandas as pd

In [10]:
cursor = conn.cursor()

In [15]:
age_groups = pd.read_sql_query("""
    Select
    count(*) as NumberOfPeople, 
    age
    From 
        Persons
    Group By age
    """,
                        conn)
age_groups.head()

   NumberOfPeople  age
0               2    5
1               1    6
2               1    7
3               3    8
4               1    9

Find the age of the group that has the maximum number of people.

In [16]:
age_groups.max()

NumberOfPeople     5
age               74
dtype: int64

Find the people who do not have a last name

In [17]:
no_last_name = pd.read_sql_query("""
    Select
        *
    From 
        Persons
    Where last_name IS NULL; 
    """,
                        conn)
no_last_name.head()

   id first_name last_name  age        city  zip_code
0   1      Erica      None   22  south port   2345678
1   2      Jordi      None   73   east port    123456
2   3    Chasity      None   70    new port  76856785
3   4      Gregg      None   31    new port  76856785
4   6       Cary      None   73    new port  76856785

In [19]:
print('People with no last name:', len(no_last_name))

People with no last name 60

Find out how many people have more than one pet

In [24]:
people_w_pets = pd.read_sql_query("""
    SELECT 
        *
    From
        Pets
    GROUP BY owner_id HAVING count(owner_id) >1
    """,
                        conn)
people_w_pets.head()

   owner_id pet_name  pet_type  treatment_done
0         2     mani       1.0               0
1         5    fenga       NaN               0
2         6     milu       1.0               0
3         7     olga       1.0               0
4         9    gimir       NaN               0

In [27]:
print("Number of people with more than one pet:", len(people_w_pets))

Number of people with more than one pet: 43

Find out how many pets have received treatment

In [30]:
treatment = pd.read_sql_query("""
    SELECT 
        *
    From
        Pets
    Where treatment_done = 1
    """,
                        conn)
treatment.head()

   owner_id pet_name  pet_type  treatment_done
0        46     raba       NaN               1
1        94   snoopy       1.0               1
2       100    bulga       NaN               1
3        16    fenga       1.0               1
4        31   chegal       1.0               1

In [34]:
print("Number of pets who have received treatment:", len(treatment))

Number of pets who have received treatment: 36

Find out how many pets have received treatment and the type of pet is known

In [32]:
treatments = pd.read_sql_query("""
    SELECT 
        *
    From
        Pets
    Where treatment_done = 1
    AND pet_type IS NOT null
    """,
                        conn)
treatments.head()

   owner_id pet_name  pet_type  treatment_done
0        94   snoopy       1.0               1
1        16    fenga       1.0               1
2        31   chegal       1.0               1
3         6     deru       1.0               1
4        69     raba       1.0               1

In [35]:
print("Number of pets who have received treatment and the pet is known:", len(treatments))

Number of pets who have received treatment and the pet is known: 16

Find out how many pets are from the cirt called **east port**

In [36]:
east_port = pd.read_sql_query("""
    SELECT 
        *
    From
        Pets
    Join persons on pets.owner_id = persons.id
    Where persons.city = 'east port'
    """,
                        conn)
east_port.head()

,owner_id,pet_name,pet_type,treatment_done,id,first_name,last_name,age,city,zip_code
0,2,gimir,1.0,0,2,Jordi,None,73,east port,123456
1,2,mani,1.0,0,2,Jordi,None,73,east port,123456
2,2,tamari,NaN,1,2,Jordi,None,73,east port,123456
3,9,gimir,NaN,0,9,Katelyn,Torphy,49,east port,9756543
4,9,palu,1.0,0,9,Katelyn,Torphy,49,east port,9756543

In [37]:
print("Number of pets in east port:", len(east_port))

Number of pets in east port: 49

Find out how many pets are from the city called **east port** and who received a treatment

In [38]:
east_port_treatment = pd.read_sql_query("""
    SELECT 
        *
    From
        Pets
    Join persons on pets.owner_id = persons.id
    Where persons.city = 'east port'
    AND pets.treatment_done = 1
    """,
                        conn)
east_port_treatment.head()

,owner_id,pet_name,pet_type,treatment_done,id,first_name,last_name,age,city,zip_code
0,2,tamari,NaN,1,2,Jordi,None,73,east port,123456
1,23,snoopy,1.0,1,23,Maynard,None,25,east port,123456
2,24,fenga,NaN,1,24,Dorian,None,40,east port,123456
3,35,dara,1.0,1,35,Maritza,None,73,east port,9756543
4,45,sami,NaN,1,45,Alfonzo,None,16,east port,2345678

In [39]:
print("Number of pets in east port and received treatment:", len(east_port_treatment))

Number of pets in east port and received treatment: 11